{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "~",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "~": 0,
      "$": 1,
      "'": 2,
      ",": 3,
      "a": 4,
      "b": 5,
      "c": 6,
      "d": 7,
      "e": 8,
      "f": 9,
      "g": 10,
      "h": 11,
      "i": 12,
      "j": 13,
      "k": 14,
      "l": 15,
      "m": 16,
      "n": 17,
      "o": 18,
      "p": 19,
      "q": 20,
      "r": 21,
      "s": 22,
      "t": 23,
      "u": 24,
      "v": 25,
      "w": 26,
      "x": 27,
      "y": 28,
      "z": 29,
      "Ċ": 30,
      "Ġ": 31,
      "Ġt": 32,
      "ou": 33,
      "Ġi": 34,
      "he": 35,
      "Ġw": 36,
      "you": 37,
      "Ġa": 38,
      "Ġyou": 39,
      "in": 40,
      "Ġs": 41,
      "Ġm": 42,
      "re": 43,
      "Ġb": 44,
      "an": 45,
      "Ġthe": 46,
      "on": 47,
      "ve": 48,
      "Ġl": 49,
      "Ġd": 50,
      "Ġc": 51,
      "ll": 52,
      "Ġf": 53,
      "ha": 54,
      "ing": 55,
      "ow": 56,
      "Ġn": 57,
      "me": 58,
      "Ġg": 59,
      "st": 60,
      "Ġto": 61,
      "Ġme": 62,
      "nd": 63,
      "and": 64,
      "Ġo": 65,
      "ke": 66,
      "Ġbe": 67,
      "Ġit": 68,
      "ay": 69,
      "it": 70,
      "hat": 71,
      "gh": 72,
      "or": 73,
      "Ġin": 74,
      "ar": 75,
      "Ġth": 76,
      "is": 77,
      "'t": 78,
      "ver": 79,
      "'s": 80,
      "Ġp": 81,
      "Ġ$": 82,
      "le": 83,
      "Ġwe": 84,
      "Ġon": 85,
      "se": 86,
      "Ġmy": 87,
      "ld": 88,
      "ght": 89,
      "Ġe": 90,
      "Ġh": 91,
      "er": 92,
      "oo": 93,
      "Ġwa": 94,
      "Ġli": 95,
      "Ġk": 96,
      "Ġand": 97,
      "ut": 98,
      "Ġof": 99,
      "Ġyour": 100,
      "ot": 101,
      "Ġhe": 102,
      "ome": 103,
      "ee": 104,
      "Ġst": 105,
      "id": 106,
      "now": 107,
      "ight": 108,
      "es": 109,
      "ac": 110,
      "et": 111,
      "Ġthat": 112,
      "ed": 113,
      "Ġha": 114,
      "ould": 115,
      "Ġr": 116,
      "ad": 117,
      "'m": 118,
      "Ġknow": 119,
      "Ġlo": 120,
      "Ġu": 121,
      "out": 122,
      "at": 123,
      "Ġwas": 124,
      "Ġall": 125,
      "en": 126,
      "ust": 127
    },
    "merges": [
      "Ġ t",
      "o u",
      "Ġ i",
      "h e",
      "Ġ w",
      "y ou",
      "Ġ a",
      "Ġ you",
      "i n",
      "Ġ s",
      "Ġ m",
      "r e",
      "Ġ b",
      "a n",
      "Ġt he",
      "o n",
      "v e",
      "Ġ l",
      "Ġ d",
      "Ġ c",
      "l l",
      "Ġ f",
      "h a",
      "in g",
      "o w",
      "Ġ n",
      "m e",
      "Ġ g",
      "s t",
      "Ġt o",
      "Ġm e",
      "n d",
      "an d",
      "Ġ o",
      "k e",
      "Ġb e",
      "Ġi t",
      "a y",
      "i t",
      "ha t",
      "g h",
      "o r",
      "Ġi n",
      "a r",
      "Ġt h",
      "i s",
      "' t",
      "ve r",
      "' s",
      "Ġ p",
      "Ġ $",
      "l e",
      "Ġw e",
      "Ġ on",
      "s e",
      "Ġm y",
      "l d",
      "gh t",
      "Ġ e",
      "Ġ h",
      "e r",
      "o o",
      "Ġw a",
      "Ġl i",
      "Ġ k",
      "Ġa nd",
      "u t",
      "Ġo f",
      "Ġyou r",
      "o t",
      "Ġ he",
      "o me",
      "e e",
      "Ġs t",
      "i d",
      "n ow",
      "i ght",
      "e s",
      "a c",
      "e t",
      "Ġt hat",
      "e d",
      "Ġ ha",
      "ou ld",
      "Ġ r",
      "a d",
      "' m",
      "Ġk now",
      "Ġl o",
      "Ġ u",
      "ou t",
      "a t",
      "Ġwa s",
      "Ġa ll",
      "e n",
      "u st"
    ]
  }
}